const questions = [
  {
    question: "Қазақстанның астанасы қай қала?",
    answers: ["Алматы", "Шымкент", "Астана", "Қарағанды"],
    correct: 2
  },
  {
    question: "1 километрде қанша метр бар?",
    answers: ["100", "1000", "10000", "10"],
    correct: 1
  },
  {
    question: "Жер шарының серігі қалай аталады?",
    answers: ["Ай", "Күн", "Юпитер", "Жұлдыз"],
    correct: 0
  },
  {
    question: "Гидросфера дегеніміз не?",
    answers: ["Ауа қабаты", "Су қабаты", "Жер қабаты", "От қабаты"],
    correct: 1
  },
  {
    question: "Массаның өлшем бірлігі қандай?",
    answers: ["Секунд", "Литр", "Килограмм", "Ампер"],
    correct: 2
  },
  // Тағы сұрақ қосуға болады
];
